Repository: sojog/Practica-AI---Python-2025-2026
Catalog: Teme/01/07.Mara_Georgescu/QUIZZ/locale/*/LC_MESSAGES/django.po
Languages: ro

source: English
ro: Engleză

source: Romanian
ro: Română

source: Dashboard
ro: Panou de control

source: Upload Note
ro: Încarcă notiță

source: Logout
ro: Deconectare

source: Login
ro: Autentificare

source: Register
ro: Înregistrare

source: Welcome back
ro: Bine ai revenit

source: Generate Recap Test
ro: Generează test recapitulativ

source: My Notes
ro: Notițele mele

source: Edit
ro: Editează

source: Generate Quiz
ro: Generează test

source: No notes yet
ro: Nicio notiță încă

source: Upload your first note to get started!
ro: Încarcă prima notiță pentru a începe!

source: Recent Quizzes
ro: Teste recente

source: Note
ro: Notiță

source: Questions
ro: Întrebări

source: Score
ro: Scor

source: Date
ro: Data

source: Actions
ro: Acțiuni

source: View Results
ro: Vezi rezultate

source: No quizzes yet. Generate your first quiz from a note!
ro: Niciun test încă. Generează primul test dintr-o notiță!

source: Review and edit the extracted text before generating your quiz
ro: Revizuiește și editează textul extras înainte de a genera testul

source: Extracted Text
ro: Text extras

source: You can edit the text above to correct any extraction errors or add additional information.
ro: Poți edita textul de mai sus pentru a corecta erorile de extragere sau pentru a adăuga informații suplimentare.

source: Save & Continue to Quiz Generation
ro: Salvează și continuă la generarea testului

source: Back to Dashboard
ro: Înapoi la panou

source: From note:
ro: Din notiță:

source: Quiz Mode
ro: Mod test

source: Number of Questions
ro: Număr de întrebări

source: Choose between 5 and 50 questions
ro: Alege între 5 și 50 de întrebări

source: Question Type
ro: Tip întrebare

source: Difficulty Level
ro: Nivel de dificultate

source: Feedback Mode
ro: Mod feedback

source: Back to Edit
ro: Înapoi la editare

source: Submit Answer
ro: Trimite răspuns

source: Next Question
ro: Următoarea întrebare

source: Correct!
ro: Corect!

source: Incorrect
ro: Incorect

source: Question:
ro: Întrebare:

source: Correct Answer:
ro: Răspuns corect:

source: Explanation:
ro: Explicație:

source: Type your answer here...
ro: Scrie răspunsul tău aici...

source: Quiz Results
ro: Rezultate test

source: Quiz Complete!
ro: Test finalizat!

source: Retake Quiz
ro: Reia testul

source: Detailed Review
ro: Revizuire detaliată

source: Correct
ro: Corect

source: Your answer
ro: Răspunsul tău

source: Your Answer:
ro: Răspunsul tău:

source: True
ro: Adevărat

source: False
ro: Fals

source: Upload your study materials (PDF, DOCX, TXT, or Images)
ro: Încarcă materialele tale de studiu (PDF, DOCX, TXT sau imagini)

source: Note Title
ro: Titlu notiță

source: Upload File
ro: Încarcă fișier

source: Supported formats: PDF, DOCX, TXT, JPG, PNG, WEBP
ro: Formate suportate: PDF, DOCX, TXT, JPG, PNG, WEBP

source: Upload & Process
ro: Încarcă și procesează

source: Cancel
ro: Anulează

source: Multiple Choice
ro: Alegere multiplă

source: True/False
ro: Adevărat/Fals

source: Fill in the Blank
ro: Completează spațiul liber

source: Short Answer
ro: Răspuns scurt

source: Mixed
ro: Mixt

source: Standard (10 questions, mixed type, medium difficulty)
ro: Standard (10 întrebări, tip mixt, dificultate medie)

source: Custom (choose your own settings)
ro: Personalizat (alege propriile setări)

source: Instant Feedback (see correct answer after each question)
ro: Feedback instant (vezi răspunsul corect după fiecare întrebare)

source: Final Feedback (see results at the end)
ro: Feedback final (vezi rezultatele la sfârșit)

source: Enter a title for your note...
ro: Introdu un titlu pentru notiță...

source: Extracted text will appear here...
ro: Textul extras va apărea aici...

source: Easy
ro: Ușor

source: Medium
ro: Mediu

source: Hard
ro: Dificil

source: Sign in to your account
ro: Conecteaza-te la contul tau

source: Don't have an account?
ro: Nu ai cont?

source: Create one
ro: Creeaza unul

source: Username
ro: Nume de utilizator

source: Password
ro: Parola

source: Sign In
ro: Conectare

source: Virtual Assistant
ro: Asistent Virtual

source: Ask by Voice
ro: Întreabă vocal

source: Ask the assistant for more details...
ro: Întreabă asistentul pentru mai multe detalii...

source: Listening...
ro: Ascult...

source: Thinking...
ro: Gândesc...

source: Error:
ro: Eroare:

source: Sorry, I couldn't process that.
ro: Îmi pare rău, nu am putut procesa asta.

source: An error occurred. Please try again.
ro: A apărut o eroare. Te rog încearcă din nou.

source: Question %(index)s of %(total)s
ro: Întrebarea %(index)s din %(total)s

source: %(percent)s%% Complete
ro: %(percent)s%% Complet

source: Quiz generated with %(count)d questions!
ro: Test generat cu %(count)d întrebări!

source: Note "%(title)s" uploaded successfully!
ro: Notița "%(title)s" a fost încărcată cu succes!

source: Text updated successfully!
ro: Text actualizat cu succes!

source: This quiz has no questions.
ro: Acest test nu are întrebări.

source: You have no mistakes to review yet. Complete some quizzes first!
ro: Nu ai greșeli de revizuit încă. Completează câteva teste mai întâi!

source: No questions found for recap.
ro: Nu s-au găsit întrebări pentru recapitulare.

source: Recap quiz generated with %(count)d questions from your mistakes!
ro: Test recapitulativ generat cu %(count)d întrebări din greșelile tale!
